      ******************************************************************
      * Author: Gil Fernandes
      * Date:  2023-11-13
      * Purpose: See if Cobol works
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world, I love you!"
            DISPLAY "This is my first cobol programme"
            STOP RUN.
       END PROGRAM HELLO.
